# library 불러오기
- 라이브러리 설치는 주피터 노트북에서 설치할 수 도 있고 터미널에서 설치할 수 있습니다.

In [1]:
import os, sys, time, datetime
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns

# 워닝 제거, 프린트 자동 사용, 그래프 및 폰트 옵션
- 워닝 제거
- print() 명령어 자동 사용 
- 그래프 마이너스 기호 처리 및 한글 폰트 깨짐 방지

In [2]:
import warnings
warnings.filterwarnings('ignore')

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

plt.rcParams['axes.unicode_minus'] = False
mpl.rcParams['font.family'] = "AppleGothic"  # 윈도우는 'Malgun Gothic' 사용하세요.

# 매직 명령어 
- 터미널 명령어를 주피터 노트북에서 사용할 때

In [3]:
# 경로 확인
%pwd
print("------------------------")

# 객체보기
%ls
print("------------------------")

# 특정 객체 보기
%ls *.csv
print("------------------------")

# 상위 경로로 이동
%cd ..
%ls
print("------------------------")

# 하위 경로로 이동
%cd "./한화"

'/Users/hooseonlee/Documents/한화'

------------------------
(기술공통) DATA Engineering_커리큘럼.pdf
00_python_training.ipynb*
01_pandas_training.ipynb
02_pandas_training.ipynb
03_numpy_training.ipynb
04_ibis_training.ipynb*
05_ibis_training.ipynb*
07_크롤링_인터넷.ipynb*
99_ibis_training_3_big data.ipynb*
old/
taxi.csv*
tmp.ipynb
강의_Python.key*
------------------------
taxi.csv*
------------------------
/Users/hooseonlee/Documents
LLM/                                고객/
Python/                             도서와 여행/
R/                                  포항공대/
Software_Prodcut/                   한화/
chatGPT/
------------------------
/Users/hooseonlee/Documents/한화

In [4]:
# 연습하세요

# 객체 유형

## 리스트

In [5]:
# 리스트의 모양과 데이터 타입 확인

a = [1, 2, 3, 4, 5]
b = ["영희", "철수", "순희", "길동"]
c = [True, False, True, False]

d = [1, 2, 3, "영희", "철수"]
e = [1, 2, 3, [4, 5]]
f = [1, 2, 3, [4, 5, [6, 7, 8]]]

f
type(f)

[1, 2, 3, [4, 5, [6, 7, 8]]]

list

In [6]:
# 리스트에서 원하는 요소(또는 원소)를 추출할 수 있으면 됩니다.

f[3][2][0]

6

In [7]:
# 리스트 인덱싱

a
a[0]    # 첫번째
a[1]    # 두번째
a[0:]   # 처음부터 끝까지
a[-1]   # 마지막
a[-2:]  # 뒤에서 2번째까지

[1, 2, 3, 4, 5]

1

2

[1, 2, 3, 4, 5]

5

[4, 5]

In [8]:
a[0::2] # 0 번째부터 2씩, [시작 인덱스값 :: 인덱스 간격값]
a[1::2] # 1 번째부터 2씩

[1, 3, 5]

[2, 4]

In [9]:
# 연습하세요.

In [10]:
e

[1, 2, 3, [4, 5]]

In [11]:
# 이중(삼중) 리스트 인덱싱 

e
e[0]       
e[3]       
e[3][0]    # 2중 리스트
e[3][-1]   # 2중 리스트

f
f[3][2][0] # 3중 리스트

[1, 2, 3, [4, 5]]

1

[4, 5]

4

5

[1, 2, 3, [4, 5, [6, 7, 8]]]

6

In [12]:
# 리스트 결합

# 리스트 더하기는 연산이 아닌 결합
a = [1, 2, 3]
b = [4, 5, 6]

a + b

[1, 2, 3, 4, 5, 6]

In [13]:
# 그럼 숫자 연산은 어떻게 합니까?

p = np.array([1,2,3])
q = np.array([4,5,6])

p + q

array([5, 7, 9])

In [14]:
# 리스트 반복하기

a = [1, 2, 3]
a * 3

[1, 2, 3, 1, 2, 3, 1, 2, 3]

In [15]:
# 각각 2번씩 반복하기

tmp = [ i for i in a for _ in range(3)]
tmp

[1, 1, 1, 2, 2, 2, 3, 3, 3]

In [16]:
# 리스트 길이

len(a)
len(tmp)

3

9

In [17]:
# 숫자와 문자 동시 보기

a
a[2]
str(a[1]) + str(a[2])  + "hi"

[1, 2, 3]

3

'23hi'

In [18]:
# 리스트 추가, 삭제, 변경 : 위치와 값을 혼동하지 마세요.

a = [1,2,3,4,5]

# 숫자 6을 추가
a.append(6) ; a   

# 0을 5위치(6번째)에 넣기
a.insert(5, 0) ; a 

# 숫자 6을 제거
a.remove(6) ; a

[1, 2, 3, 4, 5, 6]

[1, 2, 3, 4, 5, 0, 6]

[1, 2, 3, 4, 5, 0]

In [19]:
# 5번째 요소 6으로 변경

a
a[4] = 6 ; a

[1, 2, 3, 4, 5, 0]

[1, 2, 3, 4, 6, 0]

In [20]:
# 첫번째 원소 제거

del a[0] ; a

[2, 3, 4, 6, 0]

In [21]:
# 처음부터 3미만까지 제거

del a[:3] ; a

[6, 0]

In [22]:
# 모두 제거

del a

In [23]:
# 리스트 정렬

a = [2, 1, 3]
a.sort()
a

[1, 2, 3]

In [24]:
# 역으로 정렬

a.sort(reverse = True)
a

[3, 2, 1]

In [25]:
# 리스트 인덱스

a = [1, 2, 3]

# 3이 있는 위치

a.index(3)

2

In [26]:
# 리스트 카운트

a = [1, 2, 3, 3, 1]
a.count(1)

2

In [27]:
# 리스트 확장

a = [1, 2, 3]

a.extend([4, 5])
a

[1, 2, 3, 4, 5]

In [28]:
a.extend([6])
a

[1, 2, 3, 4, 5, 6]

In [29]:
# 연습하세요.

## 튜플

In [30]:
b = (0,1,2,3)
b
type(b)

c = [1,2,3]
tuple(c)

(0, 1, 2, 3)

tuple

(1, 2, 3)

In [31]:
# 튜플은 요소값을 변경할수 없기 때문에 sort, insert, remove, pop과 같은 내장 함수가 없다.

In [32]:
# 연습하세요.

## 딕셔너리

In [33]:
# 딕셔너리 만들기 : 방법 1

d = {"NO" : [1, 2, 3, 4, 5], 
     "이름" : ["영희", "철수", "순희", "길동"], 
     "가입여부" : [True, False, True, False]}

d
type(d)

{'NO': [1, 2, 3, 4, 5],
 '이름': ['영희', '철수', '순희', '길동'],
 '가입여부': [True, False, True, False]}

dict

In [34]:
# 딕셔너리 인덱싱

d["NO"]
d["이름"]
d["가입여부"]

[1, 2, 3, 4, 5]

['영희', '철수', '순희', '길동']

[True, False, True, False]

In [35]:
d.keys()    # keys only
d.values()  # values only
d.items()   # all

dict_keys(['NO', '이름', '가입여부'])

dict_values([[1, 2, 3, 4, 5], ['영희', '철수', '순희', '길동'], [True, False, True, False]])

dict_items([('NO', [1, 2, 3, 4, 5]), ('이름', ['영희', '철수', '순희', '길동']), ('가입여부', [True, False, True, False])])

In [36]:
# 딕셔너리 만들기 : 방법 2

my_d = dict(a = [1,2,3,4], 이름 = ["영희", "철수", "동수"], 나이 = [10, 12, 13])

my_d

{'a': [1, 2, 3, 4], '이름': ['영희', '철수', '동수'], '나이': [10, 12, 13]}

In [37]:
# 요소 삭제시

del my_d["a"]
my_d

{'이름': ['영희', '철수', '동수'], '나이': [10, 12, 13]}

In [38]:
# 딕셔너리 만들 때 주의할 사항 : key가 2개 이상이면 1개를 무시함

a = {1: "p", 2: "q", 1: "r"}
a[1]

'r'

In [39]:
# 연습하세요.

## 집합

In [40]:
# 집합 자료의 특징 : 중복을 허용하지 않음. 순서가 없음.

s1 = set([1,2,3]) ; s1

s2 = set("world") ; s2

{1, 2, 3}

{'d', 'l', 'o', 'r', 'w'}

In [41]:
# 인덱싱을 원할 경우 list로 변경해서 사용

l1 = list(set([1, 2, 3])) ; l1
type(set([1,2,3])) ; type(l1)
l1[0]

[1, 2, 3]

set

list

1

In [42]:
# 교집합, 합집합, 차집합

s1 = set([1, 2, 3, 4, 5])
s2 = set([3, 4, 5, 6, 7])

In [43]:
s1 & s2
s1.intersection(s2)

s1 | s2
s1.union(s2)

s1 - s2
s1.difference(s2)

{3, 4, 5}

{3, 4, 5}

{1, 2, 3, 4, 5, 6, 7}

{1, 2, 3, 4, 5, 6, 7}

{1, 2}

{1, 2}

In [44]:
# 집합 값 추가 외

s1 = set([1, 2, 3])
s1.add(4) ; s1

s1.update([4, 5, 6]) ; s1

s1.remove(1) ; s1

{1, 2, 3, 4}

{1, 2, 3, 4, 5, 6}

{2, 3, 4, 5, 6}

In [45]:
# 연습하세요.

## 데이터 프레임

In [46]:
# 데이터 프레임 만들기

df = pd.DataFrame({"name": ["철수", "동수", "민수"], "age": [5,7,9]})
df
type(df)

  name  age
0   철수    5
1   동수    7
2   민수    9

pandas.core.frame.DataFrame

In [47]:
# 딕셔너리를 데이터프레임으로 변환
my_d
type(my_d)

df = pd.DataFrame(my_d)
df
type(df)

{'이름': ['영희', '철수', '동수'], '나이': [10, 12, 13]}

dict

   이름  나이
0  영희  10
1  철수  12
2  동수  13

pandas.core.frame.DataFrame

In [48]:
import seaborn as sns

In [49]:
# pandas DataFrame : 데이터 분석에서 주로 사용하는 객체(엑셀과 유사한 포맷)

# sns.get_dataset_names()
mpg = sns.load_dataset("mpg")
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [50]:
# 데이터 구조, 변수 타입, 요약 통계치 보기 : 요약 통계치에서 무엇을 보아야 할까요?

type(mpg)
mpg.dtypes
mpg.describe() # 모든 변수를 다 보고 싶을 때 괄호 안에 include = "all" 넣으면 됩니다.

pandas.core.frame.DataFrame

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin           object
name             object
dtype: object

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [51]:
# 데이터 프레임을 다루는 과정은 01_데이터_판다스.ipynb 에서 자세히 다룹니다.

In [52]:
# 연습하세요.

# 조건문, 반복문, 함수 작성
- 처음부터 모두 기억할 필요는 없습니다.
- 처음에는 읽을 수 있으면 되고 자신이 선호하는 방법을 선택하면 됩니다.

## if 문

In [53]:
# "돈이 있으면 물건을 구매할 수 있고, 없으면 구매할 수 없다."를 컴퓨터는 어떻게 이해할까요?

money = True

if money:
    print("물건을 구매할 수 있다.")
else:
    print("물건을 구매할 수 없다.")

물건을 구매할 수 있다.

In [54]:
# 5000원 이상이 있으면 커피를 마실 수 있고, 없으면 커피를 마시기에 돈이 부족하다.

money = 6000

if money >= 5000:
    print("커피를 마실 수 있다.")
else:
    print("커피를 마시기에 돈이 부족하다.")

커피를 마실 수 있다.

In [55]:
# "5000원 이상의 현금을 가지고 있거나 카드가 있으면 택시를 타고 그렇지 않으면 걸어 가라."

cash = 4000
card = True

if cash >= 5000 or card:
    print("take a taxi")
else:
    print("take a walk")

take a taxi

In [56]:
# if elif else를 사용할 수 있습니다.

if cash >= 5000:
    print("take a taxi")
elif card:
    print("take taxi")
else:
    print("take a walk")

take taxi

In [57]:
# 하나씩 꺼내서 사용 예

payment = [cash, card]

if card in payment:
    print("take a taxi")
else:
    print("take a walk")

take a taxi

In [58]:
payment = [cash, card]

if money in payment:
    print("take a taxi")
else:
    if "dollars" in payment:
        print("take a taxi")
    else:
        print("take a walk")

take a walk

In [59]:
# 조건문을 한 문장으로 작성하면 : 아래 내용을 한글로 작성해 보세요.

score = 70
message = "success" if score >= 70 else "failure"
print(message)

score = 70
print("success" if score >= 70 else "failure")

success
success

In [60]:
mpg.head(2)

mpg["origin"].value_counts()

mpg["mpg"].mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320

origin
usa       249
japan      79
europe     70
Name: count, dtype: int64

23.514572864321607

In [61]:
# 데이터 분석에서 if문의 쓰임새를 보면 ... (3가지 방법 중 본인에게 편한 것부터 습득하세요.)

mean_mpg = mpg["mpg"].mean()

mpg["new_mpg"] = ["good" if x >= mean_mpg else "bad" for x in mpg["mpg"]]
mpg["new_mpg"].value_counts()

mpg["nation"] = mpg["origin"].map({"usa": 1, "japan": 2, "europe": 3})
mpg["nation"].value_counts() 

mpg["new_cyl"] = np.where(mpg["cylinders"] >= 6, 1, 0)
mpg["new_cyl"].value_counts()

# def map_cylinders(cyl):
#     if cyl >= 6:
#         return 1
#     else:
#         return 0

# mpg["new_cyl2"] = mpg["cylinders"].map(map_cylinders)  
# mpg["new_cyl2"].value_counts()

new_mpg
bad     209
good    189
Name: count, dtype: int64

nation
1    249
2     79
3     70
Name: count, dtype: int64

new_cyl
0    211
1    187
Name: count, dtype: int64

In [62]:
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,new_mpg,nation,new_cyl
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,bad,1,1
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,bad,1,1
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,bad,1,1
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,bad,1,1
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,bad,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,good,1,0
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,good,3,0
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,good,1,0
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,good,1,0
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,good,1,0

## while 문

In [63]:
# 열번 찍어 안넘어가는 나무 없다. 

tree_chop = 0

while tree_chop < 10:
    tree_chop = tree_chop + 1
    print(f"나무를 {tree_chop}번 찍었습니다.")
    if tree_chop == 10:
        print("나무가 넘어간다.")

나무를 1번 찍었습니다.
나무를 2번 찍었습니다.
나무를 3번 찍었습니다.
나무를 4번 찍었습니다.
나무를 5번 찍었습니다.
나무를 6번 찍었습니다.
나무를 7번 찍었습니다.
나무를 8번 찍었습니다.
나무를 9번 찍었습니다.
나무를 10번 찍었습니다.
나무가 넘어간다.

In [64]:
# 커피 머신 작동을 조건문으로 작성

money = 300
coffee = 10

while money:
    print("돈을 받았으니 커피를 줍니다.")
    coffee = coffee - 1
    print(f"남은 커피량은 {coffee}개 입니다.")
    if coffee == 0:
        print("커피가 다 떨어졌습니다. 판매를 중지합니다.")
        break

돈을 받았으니 커피를 줍니다.
남은 커피량은 9개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 8개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 7개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 6개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 5개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 4개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 3개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 2개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 1개 입니다.
돈을 받았으니 커피를 줍니다.
남은 커피량은 0개 입니다.
커피가 다 떨어졌습니다. 판매를 중지합니다.

In [65]:
# while 문의 처음으로 돌아가기 : continue

a = 0

while a < 10:
    a = a + 1
    if a % 2 == 0: continue
    print(a)

1
3
5
7
9

##  데이터 프레임에서 조건문
- iris.iloc 문법은 pandas 시간에 배웁니다.
- 개인적으로 선호하는 방법을 찾으세요.

In [66]:
iris = sns.load_dataset("iris")

iris.head(3)

iris["species"].value_counts()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [67]:
# if_else

iris = sns.load_dataset("iris")
iris["group"] = np.where(iris['species'] == 'setosa', "1", "2")
iris.iloc[[0, 1, 148, 149], :]

     sepal_length  sepal_width  petal_length  petal_width    species group
0             5.1          3.5           1.4          0.2     setosa     1
1             4.9          3.0           1.4          0.2     setosa     1
148           6.2          3.4           5.4          2.3  virginica     2
149           5.9          3.0           5.1          1.8  virginica     2

In [68]:
iris["sepal"] = np.where(iris["sepal_length"] >= iris["sepal_length"].mean(), 1, 0)
iris.iloc[[0, 1, 148, 149], :]

,sepal_length,sepal_width,petal_length,petal_width,species,group,sepal
0,5.1,3.5,1.4,0.2,setosa,1,0
1,4.9,3.0,1.4,0.2,setosa,1,0
148,6.2,3.4,5.4,2.3,virginica,2,1
149,5.9,3.0,5.1,1.8,virginica,2,1

In [69]:
# if_elif_else : 방법 1

iris["sepal2"] = np.where(iris["sepal_length"] < 5, "small", np.where((iris["sepal_length"] >= 5) & (iris["sepal_length"] < 6), "medium", "large"))

iris["sepal2"].value_counts()

# def make_var(sepal_length):
#     if sepal_length < 5:
#         return "small"
#     elif (sepal_length >= 5) & (sepal_length < 6):
#         return "medium"
#     else:
#         return "large"
    
# iris["sepal3"] = iris["sepal_length"].map(make_var)

# iris.head()

sepal2
large     67
medium    61
small     22
Name: count, dtype: int64

In [70]:
# if_elif_else : 방법 2

condition = [
    (iris["sepal_length"].lt(5)),
    (iris["sepal_length"].ge(5) & iris["sepal_length"].lt(6)),
    (iris["sepal_length"].ge(6)) 
     ]

choice = ["small", "medium", "large"]

iris["size"] = np.select(condition, choice)

iris["size"].value_counts()

size
large     67
medium    61
small     22
Name: count, dtype: int64

In [71]:
# if_elif_else : 방법 3

iris["sepal3"] = iris["sepal_length"].map(lambda x: "small" if x < 5 else ("medium" if 5 <= x < 6 else "large"))

iris["sepal3"].value_counts()

sepal3
large     67
medium    61
small     22
Name: count, dtype: int64

In [72]:
# 연습하세요.

## 반복문
- 출력을 반복
- 변수로 넣는 반복

In [73]:
# 1개씩 반복 프린트

my_list = [1, 2, 3]

for i in my_list:
    print(i)

1
2
3

In [74]:
# 2개 반복

my_list2 = [(1, 2), (3, 4)]

for (first, second) in my_list2:
    print(first + second)
    
type(first)

3
7

int

In [75]:
# 조건 반복
# 총 5명의 응시생 중 점수가 60점 이상이면 합격이고 그렇지 않으면 불합격이다. 

scores = [30, 50, 60, 70, 80]
number = 0

for i in scores:
    number = number + 1
    if i >= 60:
        print(f"{number}번 학생은 합격입니다.")
    else:
        print(f"{number}번 학생은 불합격입니다.")

1번 학생은 불합격입니다.
2번 학생은 불합격입니다.
3번 학생은 합격입니다.
4번 학생은 합격입니다.
5번 학생은 합격입니다.

In [76]:
# 조건 반복, 합격한 학생만 출력하기

scores = [30, 50, 60, 70, 80]
number = 0

for score in scores:
    number = number + 1
    if score >= 60:
        print(f"{number}번 학생 축하합니다. 합격입니다.")
        continue

3번 학생 축하합니다. 합격입니다.
4번 학생 축하합니다. 합격입니다.
5번 학생 축하합니다. 합격입니다.

In [77]:
# 1부터 10까지 누적합 출력 (print 명령어 위치 주의)

add = 0

for i in range(1, 11):
    add = add + i
    # add += i
print(add)

55

In [78]:
np.sum(range(1, 11))

55

In [79]:
# print 명령어가 들어간다면 누적합을 반복합니다.

add = 0

for i in range(1, 11):
    add = add + i
    print(add)

1
3
6
10
15
21
28
36
45
55

In [80]:
np.cumsum(range(1, 11))

array([ 1,  3,  6, 10, 15, 21, 28, 36, 45, 55])

In [81]:
# i, j 구구단 출력

for i in range(2, 10):
    for j in range(1, 10): 
        print(i * j, end = " ") # 결과값 사이에 공백 넣기
    print(" ")                  # 줄바꿈

2 4 6 8 10 12 14 16 18
3 6 9 12 15 18 21 24 27
4 8 12 16 20 24 28 32 36
5 10 15 20 25 30 35 40 45
6 12 18 24 30 36 42 48 54
7 14 21 28 35 42 49 56 63
8 16 24 32 40 48 56 64 72
9 18 27 36 45 54 63 72 81

In [82]:
# 리스트를 만드는 반복 : 방법 1

a = []

for i in range(1, 11):
    a.append(i)
a

# a에서 3의 배수만 추출
result = []

for i in a:
    if i % 3 == 0:
        result.append(i)
    else:
        continue

result

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

[3, 6, 9]

In [83]:
# 리스트 만드는 반복 : 방법 2, list comprehension

a = [i for i in range(1,11)]
a

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [84]:
b = [i for i in range(1, 11) if i % 3 == 0]
b

[3, 6, 9]

In [85]:
# pandas Vectorization (faster)

(iris['sepal_length'] + iris['sepal_width']).to_list()[0:5]

iris['petal'] = iris["petal_length"] + iris["petal_width"]
iris.head(5)

[8.6, 7.9, 7.9, 7.699999999999999, 8.6]

,sepal_length,sepal_width,petal_length,petal_width,species,group,sepal,sepal2,size,sepal3,petal
0,5.1,3.5,1.4,0.2,setosa,1,0,medium,medium,medium,1.6
1,4.9,3.0,1.4,0.2,setosa,1,0,small,small,small,1.6
2,4.7,3.2,1.3,0.2,setosa,1,0,small,small,small,1.5
3,4.6,3.1,1.5,0.2,setosa,1,0,small,small,small,1.7
4,5.0,3.6,1.4,0.2,setosa,1,0,medium,medium,medium,1.6

In [86]:
# Numpy vectorization (fastest)

(iris['sepal_length'].to_numpy() + iris['sepal_width'].to_numpy())[0:5]

array([8.6, 7.9, 7.9, 7.7, 8.6])

In [87]:
# 연습하세요.

## 함수작성
- 프린트는 출력이고 리턴은 반환입니다. 리턴 이후에 프린트 명령어는 실행되지 않습니다.

In [88]:
# 더하기 함수 출력

def my_add(a, b):
    return(a + b)
#     print("합을 구합니다")

my_add(3, 2)

5

In [89]:
# 더하기 함수 리턴
def my_add(a, b):
    print("합을 구합니다")
    return(a + b)

result = my_add(4, 7)
result

합을 구합니다

11

In [90]:
# 입력값이 없는 함수

def say():
    return("Hi")

say()

'Hi'

In [91]:
# 여러개의 인수가 있을 때 

def add_many(*args): 
    result = 0 
    for i in args: 
        result = result + i 
    return result 
    
add_many(1,2,3,4,5)

# def mul_many(*args):
#     result = 1
#     for i in args:
#         result = result * i
#     return result

# mul_many(1,2,3,4,5)

15

In [92]:
np.sum([1,2,3,4,5])
np.product([1,2,3,4,5])

15

120

In [93]:
# 연산을 선택하고 싶을 때

def add_mul(choice, *args):
    if choice == "add": 
        result = 0 
        for i in args: 
            result = result + i 
    elif choice == "mul": 
        result = 1 
        for i in args: 
            result = result * i 
    return result

add_mul("add", 1,2,3)
add_mul("mul", 1,3,5)

6

15

In [94]:
# 람다 함수 : 무기명 함수

add = lambda a, b: a+b
add(3, 7)

10

In [95]:
add_many = lambda *args: sum(args)
add_many(1,2,3,4)

10

In [96]:
# 이건 많이 복잡하네요. 

# add_mul = lambda choice, *args: sum(args) if choice == "add" else (lambda: None)() if choice != "mul" else (lambda: eval("*".join(map(str, args))))()

# add_mul("add", 1, 2, 3, 4)
# add_mul("mul", 1, 3, 5)

In [97]:
mpg = sns.load_dataset("mpg")
mpg.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin           object
name             object
dtype: object

In [98]:
type(mpg)

pandas.core.frame.DataFrame

In [99]:
# 데이터 유형 변경 함수 예

def conv_type(df):
    df["cylinders"] = df["cylinders"].astype("category")
    df["origin"]    = df["origin"].astype("category")
    df["name"]      = df["name"].astype("category")
    return df

In [100]:
# conv_type(mpg)
mpg.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin           object
name             object
dtype: object

In [101]:
iris = sns.load_dataset("iris")
iris.iloc[[0, 2], 0] = np.nan
iris.iloc[[0, 2], 1] = np.nan
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             NaN          NaN           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             NaN          NaN           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [102]:
# 결측치 있는 행 제거 함수 직접 정의

iris.isna().sum()

def drop_nulls(df, cols):
    df.dropna(subset = cols, inplace = True)
    return df  

iris_cols = ["sepal_length", "sepal_width"]

drop_nulls(iris, iris_cols)

sepal_length    2
sepal_width     2
petal_length    0
petal_width     0
species         0
dtype: int64

     sepal_length  sepal_width  petal_length  petal_width    species
1             4.9          3.0           1.4          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[148 rows x 5 columns]

In [103]:
# 결측치 제거 함수 사용 : 결측치 있는 행 삭제

iris.dropna(inplace = True)
iris.shape

(148, 5)

In [104]:
# 평균값으로 결측치 채우기 함수 정의

def fill_na(df, cols):
    for i in cols:
        av = df[i].mean()
        df[i].fillna(av, inplace = True)
    return df  
    
iris_cols = ["sepal_length", "sepal_width"]
    
fill_na(iris, iris_cols)

     sepal_length  sepal_width  petal_length  petal_width    species
1             4.9          3.0           1.4          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[148 rows x 5 columns]

In [105]:
iris = sns.load_dataset("iris")

In [106]:
iris.head(5)

num_var = iris.iloc[:, 0:4]
num_var

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [107]:
# 기존 fillna 함수 사용 : 변수별 평균으로 결측치 채우기

mean_num_var = num_var.mean()
mean_num_var

iris.fillna(mean_num_var, inplace = True)
iris.head()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [108]:
#  문자를 숫자로 변경하는 함수 작성

tmp = pd.DataFrame({
    "이름" : ["영희", "길동", "동수"],
    "나이" : ["3", "4", "5"]
})

tmp_cols = ["나이"]
tmp.dtypes

def conv_type(df, cols):
    for i in cols:
        df[i].replace("3", 3, inplace = True)
        df[i].replace("4", 4, inplace = True)
        df[i].replace("5", 5, inplace = True)
        df[i] = pd.to_numeric(df[i])
        df[i] = pd.to_numeric(df[i])
        df[i] = pd.to_numeric(df[i])
    return df 

conv_type(tmp, tmp_cols)

tmp.dtypes

이름    object
나이    object
dtype: object

   이름  나이
0  영희   3
1  길동   4
2  동수   5

이름    object
나이     int64
dtype: object

In [109]:
# 벡터 연산으로 간단하게 처리

tmp = pd.DataFrame({
    "이름" : ["영희", "길동", "동수"],
    "나이" : ["3", "4", "5"]
})

tmp["나이"] = tmp["나이"].astype(int)
tmp.dtypes

tmp["나이"] = tmp["나이"] + 1
tmp

이름    object
나이     int64
dtype: object

   이름  나이
0  영희   4
1  길동   5
2  동수   6

In [110]:
# 연습하세요.

## 문자열 처리

In [111]:
# 대문자로 변경

iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [112]:
# 변수 선택시 대괄호 방법 또는 . 방법 중 본인에게 맞는 것을 사용하세요.

iris["species"].str.upper().head(3)
iris.species.str.upper().head(3)

0    SETOSA
1    SETOSA
2    SETOSA
Name: species, dtype: object

0    SETOSA
1    SETOSA
2    SETOSA
Name: species, dtype: object

In [113]:
# 특정 문자를 포함하는 데이터 포인트(행) 보기
iris[iris["species"].str.contains("ver")].head(2)

# 데이터 프레임에서 아래와 같이 특정 열을 추출하는 명령어와 혼동하지 마세요.
iris.filter(like = "petal").head(2)
iris.filter(regex = "^se").head(2)

# 데이터 유형 조건에 맞는 열만 추출하고 싶을 때
iris.select_dtypes("object").head(2)

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor

   petal_length  petal_width
0           1.4          0.2
1           1.4          0.2

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0

  species
0  setosa
1  setosa

In [114]:
mpg = sns.load_dataset("mpg")
mpg.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320

In [115]:
# 괄호 제거

# 괄호가 있는 행을 보고
mpg[mpg["name"].str.contains("\(")]["name"].head()

# 시작괄호가 있는 행의 수를 보면
mpg[mpg["name"].str.contains("\(")].shape[0]

# 시작괄호와 종료괄호 제거
mpg["name"].str.replace("(", "").str.replace(")", "")
mpg["name"][13]

13       buick estate wagon (sw)
42             dodge monaco (sw)
43      ford country squire (sw)
44           pontiac safari (sw)
45    amc hornet sportabout (sw)
Name: name, dtype: object

36

0      chevrolet chevelle malibu
1              buick skylark 320
2             plymouth satellite
3                  amc rebel sst
4                    ford torino
                 ...
393              ford mustang gl
394                    vw pickup
395                dodge rampage
396                  ford ranger
397                   chevy s-10
Name: name, Length: 398, dtype: object

'buick estate wagon (sw)'

In [116]:
mpg.shape[0]

398

In [117]:
# 결과 확인

tmp = mpg["name"].str.replace("(", "").str.replace(")", "")

tmp
tmp[12:14]

0      chevrolet chevelle malibu
1              buick skylark 320
2             plymouth satellite
3                  amc rebel sst
4                    ford torino
                 ...
393              ford mustang gl
394                    vw pickup
395                dodge rampage
396                  ford ranger
397                   chevy s-10
Name: name, Length: 398, dtype: object

12    chevrolet monte carlo
13    buick estate wagon sw
Name: name, dtype: object

In [118]:
car = sns.load_dataset("mpg")
car["name"][13]

'buick estate wagon (sw)'

In [119]:
# 괄호 안에 내용까지 삭제하고 싶을 때

car = sns.load_dataset("mpg")
car["name"][13]

car["name"] = car["name"].str.replace(r"\(.*\)", "", regex = True) # 괄호와 내용도 삭제
car["name"][13]
car["name"][254]

car["name"] = car["name"].str.rstrip() # 공백도 삭제
car["name"][13]
car["name"][254]

'buick estate wagon (sw)'

'buick estate wagon '

'ford fairmont '

'buick estate wagon'

'ford fairmont'

## 문자열 처리 - 주의사항

In [120]:
# 문자열은 immutable

a = "pithon"
a

'pithon'

In [121]:
# a[1] = 'y'

In [122]:
b = a[0] + "y" + a[2:]
b

'python'

## 문자열 포맷팅

* 다양한 처리를 경험
* 그중에 자신이 잘 기억할 수 있는 것을 선택하세요.

In [123]:
# 숫자 대입 (%d)

"I eat %d apples." % 3

'I eat 3 apples.'

In [124]:
# 문자 대입 (%s)

"I eat %s apples." % "five"

'I eat five apples.'

In [125]:
# 변수 대입 

number = 5

"I eat %d apples." % number
"I eat %s apples." % number

'I eat 5 apples.'

'I eat 5 apples.'

In [126]:
# 2개 이상 넣기 ()와 , 사용

number = 10
day = "three"

"I ate %d apples. so I was sick for %s days." % (number, day)

'I ate 10 apples. so I was sick for three days.'

In [127]:
# %s의 특징 : 숫자도 문자형으로 적용

"I have %s apples" % 3
"I have %s apples" % 3.14

'I have 3 apples'

'I have 3.14 apples'

In [128]:
# %d와 %를 같이 쓸 때는 %%를 쓴다

# "Error is %d%." % 98

In [129]:
"Error is %d%%." % 98

'Error is 98%.'

In [130]:
# 소숫점 표현하기

"%0.2f" % 3.141592

'3.14'

## format 함수를 사용한 포매팅

In [131]:
# 숫자 바로 대입하기

"I eat {0} apples".format(3)

'I eat 3 apples'

In [132]:
# 문자열 바로 대입하기

"I eat {0} apples".format("five")

'I eat five apples'

In [133]:
# 숫자 값을 가진 변수로 대입하기

number = 3
"I eat {0} apples".format(number)

'I eat 3 apples'

In [134]:
# 2개 이상의 값 넣기

number = 10
day = "three"
"I ate {0} apples. so I was sick for {1} days.".format(number, day)

'I ate 10 apples. so I was sick for three days.'

In [135]:
# 이름으로 넣기

"I ate {number} apples. so I was sick for {day} days.".format(number=10, day=3)

'I ate 10 apples. so I was sick for 3 days.'

In [136]:
# 인덱스와 이름을 혼용해서 넣기

"I ate {0} apples. so I was sick for {day} days.".format(10, day=3)

'I ate 10 apples. so I was sick for 3 days.'

In [137]:
# 소수점 표현하기

y = 3.141592

"{0:0.2f}".format(y)

'3.14'

## f 문자열 포매팅

In [138]:
name = '홍길동'
age = 30

f'나의 이름은 {name}입니다. 나이는 {age}입니다.'

'나의 이름은 홍길동입니다. 나이는 30입니다.'

In [139]:
age = 30

f'나는 내년이면 {age+1}살이 된다.'

'나는 내년이면 31살이 된다.'

In [140]:
d = {'name':'홍길동', 'age':30}

f'나의 이름은 {d["name"]}입니다. 나이는 {d["age"]}입니다.'

'나의 이름은 홍길동입니다. 나이는 30입니다.'

In [141]:
y = 3.42134234
f"{y:0.2f}"

'3.42'

## 문자열 관련 함수

In [142]:
# b 문자 갯수

a = "hobby"
a.count("b")

2

In [143]:
# b 문자 위치

a = "Python is the best choice"
# a.find('b')
# a.find("e")
a.find("a")  # 만약 찾는 문자가 없으면 -1

-1

In [144]:
# 문자열 삽입(join)

",".join('abcd')

["a", "b", "c", "c"]
",".join(['a', 'b', 'c', 'd'])

'a,b,c,d'

['a', 'b', 'c', 'c']

'a,b,c,d'

In [145]:
# 문자열 바꾸기(replace)

a = "Life is too short"
a.replace("Life", "Your leg")

'Your leg is too short'

In [146]:
# 문자열 나누기

a = "Life is too short"
a.split()

b = "a:b:c:d"
b.split(':')

['Life', 'is', 'too', 'short']

['a', 'b', 'c', 'd']

# 내장 함수

In [147]:
type([0]); type(0)

list

int

In [148]:
# 빈리스트는 디폴트가 True

all([])
all([0])
all([1])

True

False

True

In [149]:
# all : 모두가 참인지 확인

all([0])

all([1,2,3])

all([1,2,3,0])

False

True

False

In [150]:
# any : 하나라도 참인지 확인

any([1])

any([1,2,3])

any([1,2,3,0])

True

True

True

In [151]:
# dir : 객체가 지닌 속성과 메서드(함수)를 보여줌

dir([1, 2, 3])

['__add__',
 '__class__',
 '__class_getitem__',
 '__contains__',
 '__delattr__',
 '__delitem__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__mul__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__reversed__',
 '__rmul__',
 '__setattr__',
 '__setitem__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'append',
 'clear',
 'copy',
 'count',
 'extend',
 'index',
 'insert',
 'pop',
 'remove',
 'reverse',
 'sort']

In [152]:
# 열거 함수

for i, name in enumerate(['body', 'foo', 'bar']):
    print(i, name)

0 body
1 foo
2 bar

In [153]:
# eval 함수 : 문자열을 실행하여 결과를 반환하는 함수

"1+2"
eval('1+2')

eval("'hi' + 'a'")
eval('divmod(4, 3)')  # 몫과 나머지 반환 함수

'1+2'

3

'hia'

(1, 1)

In [154]:
# 양수만 추출하는 함수

# 방법 1
def positive(l):
    result = []
    for i in l:
        if i > 0:
            result.append(i)
    return result

positive([-1, 2, 4])

# 방법 2
def positive(x):
    return x > 0

list(filter(positive, [-1, 2, 4]))

# 방법 3
list(filter(lambda x: x > 0, [-1, 2, 4]))

# 방법 4
positive_numbers = [i for i in [-1, 2, 4] if i > 0]
positive_numbers

[2, 4]

[2, 4]

[2, 4]

[2, 4]

In [155]:
# 좀 더 간결하게 하면....

# 방법 1
tmp = np.array([-1, 2, 4])
tmp[positive(tmp)]

# 방법 2
tmp[list(map(positive, tmp))]

array([2, 4])

array([2, 4])

In [156]:
# len : 원소의 갯수

len("python")
len([1,2,3])

6

3

In [157]:
# map 함수 : 요소단위(element)로 함수 적용

# 방법 1
def two_times(x):
    return x * 2

# 방법 2
list(map(two_times, [1, 2, 3, 4]))

a = [1,2,3,4]
list(map(two_times, a))

[2, 4, 6, 8]

[2, 4, 6, 8]

In [158]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [159]:
# 데이터 프레임에서 사용하면...

iris["group"] = iris["species"].map({"setosa" : 1, "versicolor": 2, "virginica": 3})
iris["group"].value_counts()

group
1    50
2    50
3    50
Name: count, dtype: int64

In [160]:
# pow 함수

pow(2, 4)

16

In [161]:
# range 함수

list(range(5))
list(range(1, 10))
list(range(0, 10, 2))

[0, 1, 2, 3, 4]

[1, 2, 3, 4, 5, 6, 7, 8, 9]

[0, 2, 4, 6, 8]

In [162]:
list(range(0, -10, -1))
list(range(-10, 0, 1))

[0, -1, -2, -3, -4, -5, -6, -7, -8, -9]

[-10, -9, -8, -7, -6, -5, -4, -3, -2, -1]

In [163]:
# sorted 함수 : 정렬된 결과를 반환

a = [3, 1, 2, 4, 5]
b = sorted(a)

a
b

[3, 1, 2, 4, 5]

[1, 2, 3, 4, 5]

In [164]:
# .sort() 함수

b = [1, 3, 2, 4, 5]
b.sort()
b
b.sort(reverse=True)
b

[1, 2, 3, 4, 5]

[5, 4, 3, 2, 1]

In [165]:
# sum, min, max

sum([1, 2, 3])
min([1, 2, 3])
max([1, 2, 3])

6

1

3

In [166]:
# zip 함수 : 동일한 갯수로 이루어진 데이터를 묶어서 반환

list(zip([1, 2, 3], [4, 5, 6]))
# list(zip([1, 2, 3], [4, 5, 6], [7, 8, 9]))
# list(zip("abc", "def"))

[(1, 4), (2, 5), (3, 6)]

# 표준 라이브러리

## 날짜 모듈

In [167]:
# datetime.date

day1 = datetime.date(2019, 12, 14)
day2 = datetime.date(2021, 6, 5)

day1
day2

datetime.date(2019, 12, 14)

datetime.date(2021, 6, 5)

In [168]:
diff = day2 - day1
diff
diff.days

datetime.timedelta(days=539)

539

In [169]:
day = datetime.date(2023, 2, 20)  # 월요일이 0
day.weekday()

0

In [170]:
day.isoweekday() # 월요일을 1로 하고 싶을 때

1

In [171]:
import time

time.time()  # 시간을 초단위로 반환

1766451540.534723

In [172]:
time.localtime(time.time())  # 연월일 시분초 형태로 변경

time.struct_time(tm_year=2025, tm_mon=12, tm_mday=23, tm_hour=9, tm_min=59, tm_sec=0, tm_wday=1, tm_yday=357, tm_isdst=0)

## 난수 모듈

In [173]:
# 0에서 1사이의 실수 난수 1개 생성

import random
random.random()

0.04902160701859204

In [174]:
# 1이상 10미만이 아니라 1에서 10까지 정수 난수 1개 생성

random.randint(1, 10)

6

In [175]:
# 샘플링 : 비복원 추출

a = [1,2,3,4,5]
random.sample(a, len(a))

[1, 3, 2, 5, 4]

In [176]:
# 샘플링 : 복원 추출 방법 1

a = [1, 2, 3, 4, 5]
sampled_list = [random.choice(a) for _ in range(len(a))]

print(sampled_list)

[4, 3, 2, 5, 5]

In [177]:
# 샘플링 : 복원 추출 방법 2

a = [1, 2, 3, 4, 5]
sampled_list = random.choices(a, k = len(a))

print(sampled_list)

[4, 1, 2, 3, 1]

In [178]:
# zip 함수의 짝이 맞지 않을 때 채우는 함수

import itertools

students = ['한민서', '황지민', '이영철', '이광수', '김승민']
snacks = ['사탕', '초컬릿', '젤리']

result = itertools.zip_longest(students, snacks, fillvalue='새우깡')
list(result)

[('한민서', '사탕'), ('황지민', '초컬릿'), ('이영철', '젤리'), ('이광수', '새우깡'), ('김승민', '새우깡')]

In [179]:
# 채우는 값을 연산으로 넣을 수도 있습니다.

students = ["길동", "민지", "도수", "춘향", "동길"]
grades = [90, 80, 70, 60]

result = itertools.zip_longest(students, grades, fillvalue= sum(grades) / len(grades))

list(result)

[('길동', 90), ('민지', 80), ('도수', 70), ('춘향', 60), ('동길', 75.0)]

## 순열과 조합

In [180]:
# 순열 : 순서를 고려 3개 중에 2개를 선택한다면

import itertools

list(itertools.permutations(['1', '2', '3'], 2))

[('1', '2'), ('1', '3'), ('2', '1'), ('2', '3'), ('3', '1'), ('3', '2')]

In [181]:
# 2개를 묶어서 프린트 하려면

for a, b in itertools.permutations(['1', '2', '3'], 2):
    print(a+b)

12
13
21
23
31
32

In [182]:
# 조합 : 순서에 상관없이 3개 중에 2개를 선택한다면

list(itertools.combinations(['1', '2', '3'], 2))

[('1', '2'), ('1', '3'), ('2', '3')]

In [183]:
# 로또는 조합입니다.

it = itertools.combinations(range(1, 46), 6)

len(list(it))

8145060

## 클래스 정의
- 조금 어려울 수 있으니 간단한 것부터 시작
- 딥러닝을 pyTorch로 구현할 때 자주 사용됨

In [184]:
# class 정의 : 붕어빵 클래스 작성

class 붕어빵:
    def __init__(self):
        print("붕어빵 선언")
        
a = 붕어빵()
a

type(a)

붕어빵 선언

__main__.붕어빵

In [185]:
del a

class 붕어빵:
    def __init__(self):
        print("붕어빵 선언")
    def show(self):
        print("show 실행")
        
a = 붕어빵()
a.show()   # self는 a를 의미하므로 ()에 아무것도 없음

붕어빵 선언
show 실행

In [186]:
del a

class 붕어빵:
    def __init__(self):
        self.kind = input("모양: ")
        self.ingredient = input("붕어빵 속: ")
        print("붕어빵 선언")
    def show(self):
        print(f"붕어빵 모양은 {self.kind}이고 붕어빵 속에는 {self.ingredient}이 들었습니다")
        
a = 붕어빵()

붕어빵 선언

In [187]:
a.kind
a.ingredient
a.show()

'붕어'

'팥'

붕어빵 모양은 붕어이고 붕어빵 속에는 팥이 들었습니다

In [188]:
# 클래스 상속

class 붕어빵2(붕어빵):
    def __init__(self):
        super().__init__()
        self.price = input("가격: ")
    def show(self):
        print(f"붕어빵 모양은 {self.kind}이고 붕어빵 속에는 {self.ingredient}이 들었고 가격은 {self.price}원 입니다.")

In [189]:
b = 붕어빵2()

붕어빵 선언

In [190]:
# 클래스가 붕어빵2인 b객체의 속성을 볼 때는 괄호가 없고 함수를 볼 때는 괄호가 있어야 합니다.
b.kind
b.ingredient
b.price

b.show()

'붕어'

'꿀'

'1000'

붕어빵 모양은 붕어이고 붕어빵 속에는 꿀이 들었고 가격은 1000원 입니다.

## 다른 예를 만들어 봅니다.

In [191]:
# FourCal 클래스를 만들고 4개의 함수를 작성하여 계산하는 경우

class FourCal:
    def __init__(self, first, second):
        self.first = first
        self.second = second
        
    def setdata(self, first, second):
        self.first = first
        self.second = second
        
    def add(self):
        result = self.first + self.second
        return result
    
    def mul(self):
        result = self.first * self.second
        return result
    
    def sub(self):
        result = self.first - self.second
        return result
    
    def div(self):
        result = self.first / self.second
        return result
    
a = FourCal(3, 7)

a.add()
a.mul()
a.sub()
a.div()

10

21

-4

0.42857142857142855

In [192]:
# 상속

class MoreFourCal(FourCal):
    def pow(self):
        result = self.first ** self.second
        return result

a = MoreFourCal(2, 3)
a.pow()

8

In [193]:
a.add()
a.div()

5

0.6666666666666666

In [194]:
import seaborn as sns

mpg = sns.load_dataset("mpg")
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10